#ifndef __TIMER_H
#define __TIMER_H
#include "sys.h"

//////////////////////////////////////////////////////////////////////////////////	
//这是ALIENTEK为了同学们学习ucos而做的例程，例程秉承简单即可用的理念
//但是作者不想对所写东西做任何担保拖责任ASCADE也不对所写内容负责
//ALIENTEK愿与广大电子爱好者一起，为推广电子技术而努力
//深圳星畔电子科技有限公司
//技术支持qq:1273122614
//copyright(c) 2009-2019
//All rights reserved												
//********************************************************************************

void TIM3_Int_Init(u16 arr,u16 psc);
void TIM3_PWM_Init(u16 arr,u16 psc);
#endif